app/controllers/counties_controller.rb

SELECT * FROM "counties"
---
  def index
    @counties = County.all

SELECT * FROM "counties" WHERE ("counties"."id" = 1)
---
  def show
    @county = County.find(params[:id])

SELECT * FROM "states" ORDER BY name
---
  def new
    @county = County.new
    @states = State.all(:order => 'name')

INSERT INTO "counties" ("name", "created_at", "updated_at", "state_id") VALUES('Cuahtémoc', '2011-04-16 22:52:37', '2011-04-16 22:52:37', 2)
---
  def create
    @county = County.new(params[:county])

    respond_to do |format|
      if @county.save