app/controllers/people_controller.rb

  def new
    @person = Person.new
    @states = State.all(:order => 'name')
    @counties = County.all(:order => 'name')
---
SELECT * FROM "states" ORDER BY name
SELECT * FROM "counties" ORDER BY name